# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Select the Average Number of Orders on a Product by Product Basis

In [8]:
cur.execute('''select count(*) as numOrders from orderdetails 
                group by productCode''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

   numOrders
0         28
1         28
2         28
3         28
4         28

In [4]:
#Your code here; use a subquery. No join will be necessary.

cur.execute(''' select avg(numOrders) from 
                (select count(*) as numOrders from orderdetails 
                group by productCode) ''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   avg(numOrders)
0       27.486239

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [10]:
cur.execute('''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

In [12]:
cur.execute('''select customerNumber,
       contactLastName,
       contactFirstName from customers where
       customerNumber = (select customerNumber from orders
       where orderDate = '2003-01-31' )''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [27]:
cur.execute(''' select sum(quantityOrdered) from orderdetails 
                group by productCode ''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

   sum(quantityOrdered)
0                  1057
1                   961
2                   999
3                   985
4                  1030

In [29]:
cur.execute('''select productName from products''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                             productName
0  1969 Harley Davidson Ultimate Chopper
1               1952 Alpine Renault 1300
2                  1996 Moto Guzzi 1100i
3   2003 Harley-Davidson Eagle Drag Bike
4                    1972 Alfa Romeo GTA

In [30]:
cur.execute(''' select sum(quantityOrdered) from orderdetails 
                group by productCode where 
                (select productName from products)''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

OperationalError: near "where": syntax error

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!